Autodesk.Revit.DB.ViewCropRegionShapeManager.GetSplitRegionOffset(System.Int32)
Returns the offset for the specified split crop region.
Remarks:
The points in the split crop region's boundary are not in model space.
Add the offset returned by this method to each point in the crop region's
boundary to transform the points into model space coordinates.
regionIndex:
Index of the split crop region (numbering starts with 0).
Returns:
A vector in model space representing the offset which is applied to the split crop region's boundary.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The provided region index is invalid.
Since:
2021

Autodesk.Revit.DB.ViewCropRegionShapeManager.SetCropShape(Autodesk.Revit.DB.CurveLoop)
Sets the boundary of the view's crop to the specified shape.
Remarks:
Depending on the shape of the argument, view's crop is set to be either rectangular or non-rectangular.
If the crop is set to be rectangular and it is also split, then the multiple view regions will be displayed for the view,
with the same proportions as the split prior to the change, but adjusted to the new rectangular shape.
This Method is reserved for setting crop shape in views that allow non-rectangular crop shapes - see property Autodesk.Revit.DB.ViewCropRegionShapeManager.CanHaveShape.
For views that don't allow non-rectangular crop shapes (e.g. Autodesk.Revit.DB.View3D), please use property Autodesk.Revit.DB.View.CropBox for that purpose.
boundary:
The crop boundary.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Boundary in boundary should represent one closed curve loop without self-intersections,
consisting of non-zero length straight lines in a plane parallel to the view plane.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The crop of the associated view is not permitted to have a non-rectangular shape.
Since:
2014

Autodesk.Revit.DB.ViewCropRegionShapeManager.IsCropRegionShapeValid(Autodesk.Revit.DB.CurveLoop)
Verifies that boundary represents one closed curve loop without self-intersections,
consisting of non-zero length straight lines in a plane parallel to the view plane.
Remarks:
Curves in boundary use model coordinates.
boundary:
The crop boundary.
Returns:
True if the passed crop boundary represents one closed curve loop without self-intersections,
consisting of non-zero length straight lines in a plane parallel to the view plane.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014